"""
프로그래밍의 시작 Hello World의 확장판입니다.
Hello My World : 이세상은 나의 것 !!
"""
print('Hello My World')

"""
파이썬 변수선언
   파이썬은 대입문을 사용하므로써 변수가 만들어 집니다.
   변수의 자료형 등을 별도로 설정하지 않아도 됩니다.
   변수명을 선언하는 것도 매우 자유롭습니다
   
   키워드를 제외하고, 표준 언어의 형태로 변수명을 사용할 수 있습니다
"""
int = 10 # int는 int() 라는 내장 함수가 있지만 변수명으로 사용가능합니다
sum = 10 # sum는 sum() 라는 내장 함수가 있지만 변수명으로 사용가능합니다
float = 10.2 # float는 float() 라는 내장 함수가 있지만 변수명으로 사용가능합니다

print(int,sum,float)

# 은 한줄 주석입니다.
'''
싱글 쿼티 3개로 둘러쌓인 라인은 모두 주석으로 인식합니다.
'''

"""
더블 쿼티 3개로 둘러쌓인 라인은 모두 주석으로 인식합니다.
"""