from iplotter import C3Plotter
# 이걸해야 그래프에 한글이 잘나온다.
rc('font',family='D2Coding')

plotter = C3Plotter()

chart = {
    "data": {
        "columns": [
            ['최고기온', 31, 29.6, 27.9, 27.8, 26.7, 26.5, 24.7, 23.2, 29.3, 27.4, 30.7, 28.6, 25.4, 31.3, 31.2, 27.9, 26.6],
            ['최저기온', 19.9, 21.4, 22.9, 20.2, 22, 21.6, 21.1, 19, 20.2, 20.7, 21.9, 22.2, 19.2, 23.9, 21.1, 21, 22],
            ['평균기온', 25.6, 25.1, 25, 23, 24, 23.8, 22.6, 19.8, 24.8, 23.5, 26.1, 25.1, 21.6, 27.1, 26, 23.7, 24]
        ],
        "types": {
            "최고기온": 'area-spline',
            "최저기온": 'area-spline',
            "평균기온": 'area-spline'
        },
        "groups": [['최고기온', '최저기온', '평균기온']]
    }
}

plotter.plot(chart)